
[
  {
    "section": "designer",
    "part":"0",
    "img":"images/homepage/3.jpg",
    "vimeo":"",
    "text":"Angel Sanchez developed an appreciation for fashion at a young age surrounded by dress forms and fabrics in his mother’s Venezuelan atelier. His first love was architecture, which he studied and practiced professionally for many years, but he soon found himself drawn to back to his mother’s work. Armed with the knowledge of form and structure from his architectural work, Sanchez founded his fashion house and quickly rose to fame throughout Latin America, and expanded internationally when the company headquartered in New York City. \n Today, Angel is renowned worldwide for evening wear designs as well as an acclaimed bridal line and is a proud member of the Council of Fashion Designers of America (CFDA). Angel Sanchez’s designs reflect his architectural discipline and structure while creating new shapes and proportions that hold true to the timeless perfection of traditional couture. His designs are architectural, contemporary, and feminine; which always include a touch of drama."
  },
  {
    "section": "brand",
    "part":"1",
    "img":"images/homepage/4.jpg",
    "videoHandle":"130770759",
    "videoId":"6b730ba4e67098b1877043700eed4e12",
    "thumbnail":"images/about-10.jpg",
    "text":"The Angel Sanchez label is a global brand with an established clientele throughout the world.  Among his celebrity devotees are Eva Longoria and Sandra Bullock, both of whom wore Angel Sanchez gowns to their weddings and to important red carpet events – Sandra Bullock to the Oscars in 2006, and Eva Longoria to the 2005 Emmy Awards, for which she received a best-dressed nod.  Other celebrity devotees who routinely wear Angel Sanchez gowns on the red carpet include Debra Messing, Salma Hayek, Giselle Bundchen, Beyonce, America Ferrera, Iman, Elizabeth Hurley, Bridget Moynahan, Thalia, and Merryl Streep. Angel Sanchez collections are sold in premier department stores worldwide, including Bergdorf Goodman, Saks Fifth Avenue and Neiman Marcus in the United States; Frattina and Saks Fifth Avenue in Mexico; Joyce in Hong Kong; and Al Hama in the UAE; as well as a number of smaller specialty stores."
  }
]
